<a href="https://colab.research.google.com/github/AbdullahTheAnalyst/Data-Science-and-AI-mohir_dev-/blob/main/Lug'atdan_Series_yaratishva_Series_metodlari.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [21]:
import pandas as pd # pandas library chaqirildi

In [26]:
import numpy as np # numpy library chaqirildi

In [27]:
from pandas import Series  # pandas librarydan Series import qilindi

In [6]:
cars_price = {                  # oddiy lug'at
    "Malibu" : 23000,
    "BMW" : 45000,
    "Spark" : 6000,
    "Nexia 3" : 12000
}
cars_price

{'Malibu': 23000, 'BMW': 45000, 'Spark': 6000, 'Nexia 3': 12000}

In [7]:
type (cars_price)  # lug'at ma'lumot turi

dict

In [28]:
cars = Series (cars_price)   # Series ga o'zgartirish
cars

Malibu     23000
BMW        45000
Spark       6000
Nexia 3    12000
dtype: int64

In [31]:
next_cars = {
    "Mercedes", "Honda", "Matiz", "Malibu"
}
next_cars

{'Honda', 'Malibu', 'Matiz', 'Mercedes'}

In [32]:
new = Series (cars_price, index = next_cars)    # index biz kiritilgan ma'lumotga asosan o'zgartirsak bo'ladi
new

Honda           NaN
Matiz           NaN
Malibu      23000.0
Mercedes        NaN
dtype: float64

In [35]:
new.isnull() # NaN ma'lumot bo'lsa true chiqaradi

Honda        True
Matiz        True
Malibu      False
Mercedes     True
dtype: bool

In [37]:
new.notnull()  # NaN ma'lumot bo'lsa false chiqaradi

Honda       False
Matiz       False
Malibu       True
Mercedes    False
dtype: bool

In [38]:
cars_price

{'Malibu': 23000, 'BMW': 45000, 'Spark': 6000, 'Nexia 3': 12000}

In [39]:
new

Honda           NaN
Matiz           NaN
Malibu      23000.0
Mercedes        NaN
dtype: float64

In [41]:
new.name = "AvtoShop"           # jadvalimizning nomi
new.index.name = "Modellar"     # indexlar nomi
new

Modellar
Honda           NaN
Matiz           NaN
Malibu      23000.0
Mercedes        NaN
Name: AvtoShop, dtype: float64

In [42]:
cars_dict = {'Malibu':40000, 'Lacetti':20000, 'Toyota':45000, 'Mazda':52000, 'Honda':38000} # bu lug'at
cars1 = Series (cars_dict)
cars1

Malibu     40000
Lacetti    20000
Toyota     45000
Mazda      52000
Honda      38000
dtype: int64

In [43]:
new_prices = Series({"Honda":5000, "Mazda":-3000, "Malibu":4500, "Toyota":5200, 'Lacetti':-1200})
cars2 = Series (new_prices)
cars2

Honda      5000
Mazda     -3000
Malibu     4500
Toyota     5200
Lacetti   -1200
dtype: int64

In [45]:
cars1 + cars2    # Series turidagi jadvallarda ham arifmetik amallarni ham bajarsak bo'ladi

Honda      43000
Lacetti    18800
Malibu     44500
Mazda      49000
Toyota     50200
dtype: int64

In [47]:
cars1.index    # indexni nomini aniqlaydi

Index(['Malibu', 'Lacetti', 'Toyota', 'Mazda', 'Honda'], dtype='object')

In [49]:
cars1.values  # qiymatlarni nomini aniqlaydi

array([40000, 20000, 45000, 52000, 38000])

In [50]:
cars1.hasnans     # NaN ma'lumot bormi yoki yo'qmi aniqlaydi

False

In [52]:
cars1.dtype   # turini aniqlaydi

dtype('int64')

In [53]:
cars1.is_unique  # takrorlanmas ma'lumot bo'lmasa True qiymat beradi, va aksincha

True

In [54]:
cars1.shape  # Series hajmi

(5,)

In [55]:
cars1.size

5

In [56]:
cars1.iloc[-1]    # index bo'yicha ma'lumotni topib beradi

38000

In [58]:
cars1.max()    # Series ichidagi maximum qiymatni beradi

52000

In [59]:
cars1.min()    # Series ichidagi minimum qiymatni beradi

20000

In [60]:
cars1.mean()        # Series ichidagi o'rtacha qiymatni beradi

39000.0